fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/BKM_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.BKM_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.BKM_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/BKM_СведенияОбОтпусках/BKM_СведенияОбОтпусках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BKM_СведенияОбОтпусках</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПлановаяПродолжительностьОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.BKM_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
     	Возврат;
	КонецЕсли;
	
	Если ГрафикУжеСуществует() Тогда
		
		ТекстСообщения = СтрШаблон("Запись не возможна. На %1 год график уже существует.", Формат(Год,"ЧГ=0"));
	    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Год",,Отказ);
		Возврат;
				
	КонецЕсли;

КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
		 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BKM_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(BKM_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, BKM_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1) КАК ПродолжительностьОтпуска
		|ИЗ
		|	Документ.BKM_ГрафикОтпусков.ОтпускаСотрудников КАК BKM_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	BKM_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	BKM_ГрафикОтпусковОтпускаСотрудников.Сотрудник";
	

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	// регистр BKM_СведенияОбОтпусках 
	Движения.BKM_СведенияОбОтпусках.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.BKM_СведенияОбОтпусках.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Год = Год;
		Движение.ПлановаяПродолжительностьОтпуска = Выборка.ПродолжительностьОтпуска;
		
	КонецЦикла;

	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ГрафикУжеСуществует()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	BKM_ГрафикОтпусков.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.BKM_ГрафикОтпусков КАК BKM_ГрафикОтпусков
		|ГДЕ
		|	BKM_ГрафикОтпусков.Год = &Год
		|	И BKM_ГрафикОтпусков.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Год", Год);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();

КонецФункции

#КонецОбласти

#КонецЕсли
